 IDENTIFICATION DIVISION.
 PROGRAM-ID.    PERF04.

 ENVIRONMENT DIVISION.
 CONFIGURATION SECTION.
* INPUT-OUTPUT SECTION.

 DATA DIVISION.
 FILE SECTION.     
 WORKING-STORAGE SECTION.
 01  WS-COUNTERS.
     05 WS-TEST-COUNTER              PIC  9(4).
     05 WS-TEST-COUNTER-EXPECTED     PIC  9(4).
     05 WS-PERFORM-COUNT             PIC S9(4).

 PROCEDURE DIVISION.
 0000-PROGRAM-ENTRY.
     MOVE 0              TO WS-TEST-COUNTER.
     MOVE 11             TO WS-PERFORM-COUNT.
     MOVE 11             TO WS-TEST-COUNTER-EXPECTED.
     PERFORM B000-PERF1 WS-PERFORM-COUNT TIMES.          

     PERFORM E000-SUMMARY.
     MOVE 0              TO WS-TEST-COUNTER.
     MOVE 0              TO WS-PERFORM-COUNT.
     MOVE 0              TO WS-TEST-COUNTER-EXPECTED.
     PERFORM B000-PERF1 WS-PERFORM-COUNT TIMES.          
     PERFORM E000-SUMMARY.

     MOVE 0              TO WS-TEST-COUNTER.
     MOVE -7             TO WS-PERFORM-COUNT.
     MOVE 0              TO WS-TEST-COUNTER-EXPECTED.
     PERFORM B000-PERF1 WS-PERFORM-COUNT TIMES.          
     PERFORM E000-SUMMARY.
     STOP RUN.
      
     DISPLAY "P002:(IL):(FA):PROGRAM RAN PAST STOP RUN".

 B000-PERF1.
     ADD 1             TO WS-TEST-COUNTER.

 E000-SUMMARY.
     DISPLAY "P005:(" WS-TEST-COUNTER "):("
             WS-TEST-COUNTER-EXPECTED "):"
         "PERFORM PIC S9(4) TIMES TEST".
