 IDENTIFICATION DIVISION.
 PROGRAM-ID.    PERF02.

 ENVIRONMENT DIVISION.
 CONFIGURATION SECTION.
* INPUT-OUTPUT SECTION.

 DATA DIVISION.
 FILE SECTION.     
 WORKING-STORAGE SECTION.
 01  WS-COUNTERS.
     05 WS-TEST-COUNTER              PIC  9(4).

 PROCEDURE DIVISION.
 0000-PROGRAM-ENTRY.
      MOVE 0              TO WS-TEST-COUNTER.
      PERFORM B000-PERF1 15 TIMES.
      PERFORM E000-SUMMARY.
      STOP RUN.
      
      DISPLAY "P002:(IL):(FA):PROGRAM RAN PAST STOP RUN".

 B000-PERF1.
      ADD 1             TO WS-TEST-COUNTER.

 E000-SUMMARY.
      DISPLAY "P003:(" WS-TEST-COUNTER "):(0015):"
          "PERFORM 15 TIMES TEST".
