 IDENTIFICATION DIVISION.
 PROGRAM-ID.    TEST16.
   
 ENVIRONMENT DIVISION.

 CONFIGURATION SECTION. 
 SPECIAL-NAMES.
    DECIMAL-POINT IS COMMA.
* INPUT-OUTPUT SECTION.
* FILE-CONTROL.

 DATA DIVISION.
 FILE SECTION.

 WORKING-STORAGE SECTION.
 01	 I		 PIC 9(5).
 01	 J		 PIC 9(5).
 01	 IA.
   03	 IAX	 
     OCCURS 5 TIMES	 PIC 9(5).
 01	 TBL.
   03	 TBLX
     OCCURS 5 TIMES	 PIC 9(5).
     
 PROCEDURE DIVISION.

     PERFORM A-100.
     PERFORM A-200 VARYING I FROM 1 BY 1 UNTIL I = 5.
     STOP RUN.
 
 
 A-100.

     DISPLAY "ENTER A-100".

     MOVE 2 TO IAX ( 2 ).
     MOVE 3 TO I.
     MOVE 123 TO J.
     MOVE 123 TO TBLX ( I ).
     IF TBLX ( I ) EQUAL J
        DISPLAY "EQUALITY FOUND"
     ELSE
         DISPLAY "SOMETHING IS WRONG".

     DISPLAY "TBLX ( I ) = " TBLX ( I ) " , J = " J.

     DISPLAY "EXIT  A-100".

 A-200.

     DISPLAY "ENTER A-200".
 
     DISPLAY "A-200 I=" I.
     GO TO A-310 A-320 A-330 DEPENDING ON I.
 
     DISPLAY "EXIT  A-200".

 A-310.

     DISPLAY "ENTER A-310".
     DISPLAY "A-310 I=" I.
     DISPLAY "EXIT  A-310".
     EXIT.

 A-320.

     DISPLAY "ENTER A-320".
     DISPLAY "A-320 I=" I.
     DISPLAY "EXIT  A-320".
     EXIT.

 A-330.

     DISPLAY "ENTER A-330".
     DISPLAY "A-330 I=" I.
     DISPLAY "EXIT  A-330".
     EXIT.


