 IDENTIFICATION DIVISION.
 PROGRAM-ID. TEST29m.
 ENVIRONMENT DIVISION.
 CONFIGURATION SECTION.
* INPUT-OUTPUT SECTION.
 DATA DIVISION.
 FILE SECTION.

 WORKING-STORAGE SECTION.
  
 01 VAR-MISC.
    05 VAR0        PIC X(52) VALUE
       "ABCDEFGHIJKLMNOPQRSTUVWXYZabcdefghijklmnopqrstuvwxyz".
    05 IDX         PIC 9(9) COMP.

 01 VAR1.
   05 COMMON1      PIC X(10).
   05 FILLER       PIC X(6).
   05 COMMON2      PIC X(8).
   05 ALONE1       PIC X(8).

 01 VAR2.
   05 FILLER       PIC X(5).
   05 COMMON2      PIC X(11).
  05 COMMON1.
     10 COMMON1-1  PIC X(3).
     10 COMMON1-2  PIC X(4).
   05 ALONE2       PIC X(9).

 01 VAR3.
   05 ITEM-B.
     10 ITEM-1     PIC 99.
     10 ITEM-2     PIC 9V9.
     10 ITEM-3     PIC A(4).
     10 ITEM-4     PIC 9(4).
     10 ITEM-5     PIC 9(10) COMP.

 01 VAR4.
*   05 ITEM-A OCCURS 3 TIMES.
   05 ITEM-A.
     10 ITEM-1     PIC S9(3).
     10 ITEM-2     PIC 99V9.
     10 ITEM-3     PIC X(4).
     10 ITEM-4 REDEFINES ITEM-3 PIC 9(4).
     10 ITEM-5     PIC 9(10) COMP.

 PROCEDURE DIVISION.

 A-000.
 PERFORM A-100.
*  PERFORM A-200 VARYING 
*      IDX FROM 1 BY 1 
*      UNTIL IDX = 3.
 PERFORM A-200. 
 PERFORM A-300.
 STOP RUN.

 A-100.

 DISPLAY "BEGIN A-100:".

 MOVE VAR0   TO VAR1.
 MOVE SPACES TO VAR2.
 MOVE CORR VAR1 TO VAR2.
 DISPLAY "A-100 :" VAR1 ":".
 DISPLAY "A-100 :" VAR2 ":".

 DISPLAY "END   A-100:".

 A-200.

 DISPLAY "BEGIN A-200:".

*  MOVE +22    TO ITEM-1 (IDX) OF VAR4.
*  MOVE -11.4  TO ITEM-2 (IDX) OF VAR4.
*  MOVE "1010" TO ITEM-3 (IDX) OF VAR4.
*  MOVE IDX    TO ITEM-5 (IDX) OF VAR4.
 
 MOVE -123   TO ITEM-1 OF ITEM-A.
 MOVE 21.4   TO ITEM-2 OF ITEM-A.
 MOVE "1010" TO ITEM-3 OF ITEM-A.
 MOVE 1234   TO ITEM-4 OF ITEM-A.
 MOVE 333    TO ITEM-5 OF ITEM-A.

 MOVE 56     TO ITEM-1 OF ITEM-B.
 MOVE 7.8    TO ITEM-2 OF ITEM-B.
 MOVE "8080" TO ITEM-3 OF ITEM-B.
 MOVE 7890   TO ITEM-4 OF ITEM-B.
 MOVE 4455   TO ITEM-5 OF ITEM-B.


 DISPLAY "END   A-200:".

 A-300.

 DISPLAY "BEGIN A-300:".

 DISPLAY "A-300: (Before) ITEM-1 OF ITEM-A=" ITEM-1 OF ITEM-A.
 DISPLAY "A-300: (Before) ITEM-2 OF ITEM-A=" ITEM-2 OF ITEM-A.
 DISPLAY "A-300: (Before) ITEM-3 OF ITEM-A=" ITEM-3 OF ITEM-A.
 DISPLAY "A-300: (Before) ITEM-4 OF ITEM-A=" ITEM-4 OF ITEM-A.
 DISPLAY "A-300: (Before) ITEM-5 OF ITEM-A=" ITEM-5 OF ITEM-A.
 DISPLAY "A-300: (Before) ITEM-1 OF ITEM-B=" ITEM-1 OF ITEM-B.
 DISPLAY "A-300: (Before) ITEM-2 OF ITEM-B=" ITEM-2 OF ITEM-B.
 DISPLAY "A-300: (Before) ITEM-3 OF ITEM-B=" ITEM-3 OF ITEM-B.
 DISPLAY "A-300: (Before) ITEM-4 OF ITEM-B=" ITEM-4 OF ITEM-B.
 DISPLAY "A-300: (Before) ITEM-5 OF ITEM-B=" ITEM-5 OF ITEM-B.

* MOVE CORRESPONDING ITEM-B TO ITEM-A (2).
* MOVE CORRESPONDING ITEM-B TO ITEM-A.
 MOVE CORRESPONDING ITEM-A TO ITEM-B.

 DISPLAY "A-300: (After ) ITEM-1 OF ITEM-B=" ITEM-1 OF ITEM-B.
 DISPLAY "A-300: (After ) ITEM-2 OF ITEM-B=" ITEM-2 OF ITEM-B.
 DISPLAY "A-300: (After ) ITEM-3 OF ITEM-B=" ITEM-3 OF ITEM-B.
 DISPLAY "A-300: (After ) ITEM-4 OF ITEM-B=" ITEM-4 OF ITEM-B.
 DISPLAY "A-300: (After ) ITEM-5 OF ITEM-B=" ITEM-5 OF ITEM-B.

 DISPLAY "END   A-300:".
