 IDENTIFICATION DIVISION.
 PROGRAM-ID. TEST05f.
 ENVIRONMENT DIVISION.
 CONFIGURATION SECTION.
* INPUT-OUTPUT SECTION.
* FILE-CONTROL.
 DATA DIVISION.
 FILE SECTION.

 WORKING-STORAGE SECTION.
 01  WS-WHOLE-NAME        PIC X(15) VALUE 'WHOLE NAME'.
 01  WS-LAST-NAME         PIC X(15) VALUE ALL '$'.

 PROCEDURE DIVISION.
 
 S-000 SECTION.

     DISPLAY "ENTER: PERFORM S-100 SECTION".
     PERFORM S-100.
     DISPLAY "EXIT : PERFORM S-100 SECTION".
     DISPLAY "ENTER: PERFORM S-200 SECTION".
     PERFORM S-200.
     DISPLAY "EXIT : PERFORM S-200 SECTION".
     DISPLAY "ENTER: PERFORM A-100 OF S-200".
     PERFORM A-100 OF S-200.
     DISPLAY "EXIT : PERFORM A-100 OF S-200".
     DISPLAY "ENTER: PERFORM A-100 OF S-100".
     PERFORM A-100 OF S-100.
     DISPLAY "EXIT : PERFORM A-100 OF S-100".
     DISPLAY "ENTER: PERFORM D-000".
     PERFORM D-000.
     DISPLAY "EXIT : PERFORM D-000".
     DISPLAY "ENTER: PERFORM S-100 THRU S-200 SECTION".
     PERFORM S-100 THRU S-200.
     DISPLAY "EXIT : PERFORM S-100 THRU S-200 SECTION".
     STOP RUN.

 S-100 SECTION.

 A-000.
     DISPLAY "ENTER A-000 OF S-100 SECTION".
     DISPLAY "EXIT  A-000 OF S-100 SECTION".
 
 A-100.
     DISPLAY "ENTER A-100 OF S-100 SECTION".
     DISPLAY "EXIT  A-100 OF S-100 SECTION".
 
 B-300.
     DISPLAY "ENTER B-300 OF S-100 SECTION".
     DISPLAY "EXIT  B-300 OF S-100 SECTION".
 
 S-200 SECTION.

 A-000.
     DISPLAY "ENTER A-000 OF S-200 SECTION".
     DISPLAY "EXIT  A-000 OF S-200 SECTION".
 
 A-100.
     DISPLAY "ENTER A-100 OF S-200 SECTION".
     DISPLAY "EXIT  A-100 OF S-200 SECTION".

*     EXIT.

 B-400.
     DISPLAY "ENTER B-400 OF S-200 SECTION".
     DISPLAY "EXIT  B-400 OF S-200 SECTION".

 S-300 SECTION.

 D-000.
     DISPLAY "ENTER D-000 OF S-300 SECTION".
     DISPLAY "EXIT  D-000 OF S-300 SECTION".
 
 D-100.
     DISPLAY "ENTER D-100 OF S-300 SECTION".
     DISPLAY "EXIT  D-100 OF S-300 SECTION".

     EXIT.

 D-200.
     DISPLAY "ENTER D-200 OF S-300 SECTION".
     DISPLAY "EXIT  D-200 OF S-300 SECTION".

