 IDENTIFICATION DIVISION.
 PROGRAM-ID.    TEST05a.
 ENVIRONMENT DIVISION.

 CONFIGURATION SECTION. 
*  SPECIAL-NAMES.
*  DECIMAL-POINT IS COMMA.
* INPUT-OUTPUT SECTION.
  
 DATA DIVISION.
 FILE SECTION.

 WORKING-STORAGE SECTION.
 01  IDX   PIC  9(05).

 PROCEDURE DIVISION.

     DISPLAY "BEFORE PERFORM".
     PERFORM 01-TEST.
     DISPLAY "ANOTHER PERFORM".
     PERFORM 01-TEST THRU 01-TEST-1.
     DISPLAY "PERFORM SUCESSFUL".
     STOP RUN.

 01-TEST.
     DISPLAY "INSIDE PERFORM".
 01-TEST-1.
     DISPLAY "ANOTHER PARAGRAPH".
 01-TEST-END.
     DISPLAY "AFTER PERFORM (WRONG)".

 99-END.
     STOP RUN.

