 IDENTIFICATION DIVISION.
 PROGRAM-ID. PTEST05.
 AUTHOR.  Bernard GIROUD.
 INSTALLATION. Tiny Cobol Compiler Project.
 DATE-WRITTEN. 05-AUG-2000.
 DATE-COMPILED.
 SECURITY. NONE.

 ENVIRONMENT DIVISION.
* INPUT-OUTPUT SECTION.
* FILE-CONTROL.
 DATA DIVISION.
 FILE SECTION.

 WORKING-STORAGE SECTION.
 01 PARM01 PIC X(20) VALUE "ABCDEFGHIJ0123456789".
 01 PARM02.
    05 FILLER PIC X(4)  VALUE "ABCD".
    05 FILLER PIC X     VALUE LOW-VALUE.
 01 PARM03.
    05 FILLER PIC X(4)  VALUE "0123".
    05 FILLER PIC X     VALUE LOW-VALUE.
 01 PARM04.
    05 FILLER PIC X(4)  VALUE "EFGH".
    05 FILLER PIC X     VALUE LOW-VALUE.
 01 PARM05.
    05 FILLER PIC X(4)  VALUE "4567".
    05 FILLER PIC X     VALUE LOW-VALUE.
 01 RES1.
    05 EPARM02 PIC X(4).
    05 EPARM03 PIC X(4).
    05 EPARM04 PIC X(4).
    05 EPARM05 PIC X(4).

 PROCEDURE DIVISION.
     CALL "STEST04" USING PARM01.
     CALL "STEST04" USING PARM01.
     STOP RUN.
