 IDENTIFICATION DIVISION.
 PROGRAM-ID. PTEST04.
 ENVIRONMENT DIVISION.
* INPUT-OUTPUT SECTION.
 DATA DIVISION.
 FILE SECTION.

 WORKING-STORAGE SECTION.
 01 PARM01 PIC X VALUE " ".
 01 G-PARM04.
    05 PARM04 PIC X(3).
    05 FILLER PIC X VALUE LOW-VALUE.
 01 WRES01 PIC S9(4) COMP.
 01 WRES02 PIC S9(9) COMP.
 01 WERES01 PIC 9(4).
 01 WERES02 PIC 9(9).

 PROCEDURE DIVISION.
     MOVE FUNCTION LENGTH(G-PARM04) TO WERES01.
     DISPLAY "C401:(" WERES01 "):(0004):Length of group".

     MOVE FUNCTION ORD(PARM01) TO WERES01.
     DISPLAY "C402:(" WERES01 "):(0033):Ord of var space".

     MOVE FUNCTION ORD("A") TO WERES01.
     DISPLAY "C403:(" WERES01 "):(0066):Ord of lit A".

*    MOVE FUNCTION CHAR(67) TO PARM01.
*    DISPLAY "C404:(" PARM01 "):(B):Char of lit 67".
     STOP RUN.

