 IDENTIFICATION DIVISION.
 PROGRAM-ID. PTEST01.
 AUTHOR.  Bernard GIROUD.
 INSTALLATION. Tiny Cobol Compiler Project.
 DATE-WRITTEN. 05-AUG-2000.
 DATE-COMPILED.
 SECURITY. NONE.

 ENVIRONMENT DIVISION.
* INPUT-OUTPUT SECTION.
* FILE-CONTROL.
 DATA DIVISION.
 FILE SECTION.

 WORKING-STORAGE SECTION.
 01 PARM01 PIC X(20) VALUE "ABCDEFGHIJ0123456789".
 01 PARM02.
    05 FILLER PIC X(4)  VALUE "ABCD".
    05 FILLER PIC X     VALUE LOW-VALUE.
 01 PARM03.
    05 FILLER PIC X(4)  VALUE "0123".
    05 FILLER PIC X     VALUE LOW-VALUE.
 01 PARM04.
    05 FILLER PIC X(4)  VALUE "EFGH".
    05 FILLER PIC X     VALUE LOW-VALUE.
 01 PARM05.
    05 FILLER PIC X(4)  VALUE "4567".
    05 FILLER PIC X     VALUE LOW-VALUE.
 01 RES1.
    05 EPARM02 PIC X(4).
    05 EPARM03 PIC X(4).
    05 EPARM04 PIC X(4).
    05 EPARM05 PIC X(4).
 01 PROGRAM-STATUS PIC 9(8) COMP VALUE 0.

 PROCEDURE DIVISION.
     CALL "STEST01" USING PARM01.
     DISPLAY "C002:(" PARM01 "):(9876543210JIHGFEDCBA):"
             "Call by reference x(20).".

     MOVE "ABCDEFGHIJ0123456789" TO PARM01.
     CALL "STEST03" USING BY CONTENT PARM01.
     DISPLAY "C004:(" PARM01 "):(ABCDEFGHIJ0123456789):"
             "Call by content x(20).".

     CALL "STEST910" USING PARM02 BY CONTENT PARM03
          BY REFERENCE PARM04 BY CONTENT PARM05
          RETURNING PROGRAM-STATUS
         .
     MOVE PARM02 TO EPARM02.
     MOVE PARM03 TO EPARM03.
     MOVE PARM04 TO EPARM04.
     MOVE PARM05 TO EPARM05.
     DISPLAY "C005:(" RES1 "):(AB9D0123EF9H4567):"
             "Call by ref and by content in alternance x(4).".
     STOP RUN.
