 IDENTIFICATION DIVISION.
 PROGRAM-ID. STEST02.
 AUTHOR.  Bernard GIROUD.
 INSTALLATION. Tiny Cobol Compiler Project.
 DATE-WRITTEN. 05-AUG-2000.
 DATE-COMPILED.
 SECURITY. NONE.

 ENVIRONMENT DIVISION.
* INPUT-OUTPUT SECTION.
* FILE-CONTROL.
 DATA DIVISION.
 FILE SECTION.

 WORKING-STORAGE SECTION.
* 01 WVAL PIC 99 VALUE "05".
 01 WVAL PIC 99 VALUE 05.

 LINKAGE SECTION.
 01 LFUNC PIC 9.
 01 LVAL  PIC 99.

 PROCEDURE DIVISION USING LFUNC LVAL.
     IF LFUNC = 1
        ADD LVAL TO WVAL
     ELSE
        DISPLAY "MR05:(" WVAL "):(09):"
             "Static counter.".
     EXIT PROGRAM.
