 IDENTIFICATION DIVISION.
 PROGRAM-ID. STEST04 INITIAL PROGRAM.
*PROGRAM-ID. STEST04.
 AUTHOR.  Bernard GIROUD.
 INSTALLATION. Tiny Cobol Compiler Project.
 DATE-WRITTEN. 05-AUG-2000.
 DATE-COMPILED.
 SECURITY. NONE.

 ENVIRONMENT DIVISION.
* INPUT-OUTPUT SECTION.
* FILE-CONTROL.
 DATA DIVISION.
 FILE SECTION.

 WORKING-STORAGE SECTION.
 01 PARM01 PIC X(04) VALUE "TEST".

 LINKAGE SECTION.
 01 L-PARM01 PIC X(20).

 PROCEDURE DIVISION USING L-PARM01.
     DISPLAY "C401:(" PARM01 "):(TEST):" "Initial.".
     MOVE SPACE TO PARM01.
     EXIT PROGRAM.
