IDENTIFICATION DIVISION.
PROGRAM-ID. TEST10.
ENVIRONMENT DIVISION.

CONFIGURATION SECTION. 
SPECIAL-NAMES.
*>     DECIMAL-POINT IS COMMA.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
  SELECT ARQ ASSIGN TO "fileTEST10.dat" 
      ORGANIZATION IS LINE SEQUENTIAL
      ACCESS MODE  IS SEQUENTIAL
      FILE STATUS  IS FS.

DATA DIVISION.
FILE SECTION.

 FD ARQ
    LABEL RECORD IS STANDARD.
 01 REG-ARQ.
   03 P-IND                  PIC  9(03).
   03 DESCRIPTION            PIC  X(20) VALUE "aaaaaaaaab".
 
WORKING-STORAGE SECTION.
  01 FS                      PIC 9(02).
  01 W-COUNTER               PIC 9(15).
  01 REM                     PIC 9(5).
  01 W01-SWITCHES            PIC X(03).
    88 W01-END VALUE "YES".
    88 W01-MORE VALUE "NO".

PROCEDURE DIVISION.
MAIN SECTION.
     OPEN OUTPUT ARQ.
     IF FS > 0
     THEN
        DISPLAY "Error Creating File: " FS
        STOP RUN.
     MOVE ZERO TO W-COUNTER.
     PERFORM WRITE-IT 998 TIMES.
     CLOSE ARQ.
     OPEN INPUT ARQ.
     IF FS > 0
     THEN
        DISPLAY "Error Opening File: " FS
        STOP RUN.
     MOVE "NO" TO W01-SWITCHES.
     PERFORM READ-IT UNTIL W01-END.
     CLOSE ARQ.
     STOP RUN.

WRITE-IT.
     ADD 1 TO W-COUNTER.
     MOVE W-COUNTER TO P-IND.
     WRITE REG-ARQ.
     IF FS > 0
     THEN
        DISPLAY "Error Writing File: " FS
        STOP RUN.

READ-IT.
     READ ARQ AT END 
        MOVE "YES" TO W01-SWITCHES.
     IF W01-MORE
     THEN
        DISPLAY REG-ARQ.
 
