 IDENTIFICATION DIVISION.
 PROGRAM-ID. TEST02.
 ENVIRONMENT DIVISION.
 CONFIGURATION SECTION.
  SPECIAL-NAMES.
*> INPUT-OUTPUT SECTION.
*> FILE-CONTROL.
 DATA DIVISION.
 FILE SECTION.

 WORKING-STORAGE SECTION.
 01     IDX1                       PIC  99 VALUE 1.

 01     TABEL-A.
       10    TAB-A OCCURS 20 TIMES    PIC 9(05).

 01     TABEL-AR REDEFINES TABEL-A.
       10    TAB-AR1 PIC 9(5).
       10    TAB-AR2 PIC 9(5).
       10    TAB-AR3 PIC 9(5).

 01     WX02 PIC X(5).
 01     WX03 PIC X(5).
 01     WE-BOOLEAN PIC X(5).

 01     TABEL-B.
    05  TAB-B0 OCCURS 2 TIMES.
       10    TAB-B1  PIC 9(5) value 12345.

 01     TABEL-BR REDEFINES TABEL-B PIC 9(10).

PROCEDURE DIVISION.

A-000.
 MOVE 12345 TO TAB-A(IDX1).
 MOVE 67890 TO TAB-A(3).
 MOVE TABEL-A(1:5) TO WX02.
 DISPLAY "RM01:(" WX02 "):(12345):1 TO 5".
 MOVE TABEL-A(2:3) TO WX02.
 DISPLAY "RM02:(" WX02 "):(234  ):2 TO 3".
 MOVE TABEL-A      TO WX02.
 DISPLAY "RM03:(" WX02 "):(12345):Not specified".
 MOVE 3 TO IDX1.
 MOVE TABEL-A(IDX1:3) TO WX02.
 DISPLAY "RM04:(" WX02 "):(345  ):V 3 TO 5".
 MOVE TABEL-A(2:IDX1) TO WX02.
 DISPLAY "RM05:(" WX02 "):(234  ):2 TO V 3".
 MOVE TAB-A OF TABEL-A(IDX1)(1:4) TO WX02.
 DISPLAY "RM06:(" WX02 "):(6789 ):OV3, 1 TO 4".

 IF WX02(2:2) = "78"
    MOVE "TRUE" TO WE-BOOLEAN
 ELSE MOVE "FALSE" TO WE-BOOLEAN.
 DISPLAY "RM07:(" WE-BOOLEAN "):(TRUE ):Comparison var 2:2".

 MOVE TABEL-A(1:5) TO WX03.
 MOVE WX03(2:) TO WX02.
 DISPLAY "RM08:(" WX02 "):(2345 ):2 LIT TO EOV".
 MOVE 3 TO IDX1.
 MOVE WX03(IDX1:) TO WX02.
 DISPLAY "RM09:(" WX02 "):(345  ):3 VAR TO EOV".

B-000.
 DISPLAY "RM10:(" TABEL-BR "):(1234512345):2 OV TO VAR".

 STOP RUN.
