 IDENTIFICATION DIVISION.
 PROGRAM-ID. TEST1-FORMATS.
 AUTHOR.  GLEN COLBERT.

 ENVIRONMENT DIVISION.
 INPUT-OUTPUT SECTION.
 FILE-CONTROL.
 DATA DIVISION.
 FILE SECTION.

 WORKING-STORAGE SECTION.
 01  WS-ALPHANUM-FIELDS.
     05 WS-ALPHANUM-1                PIC X(01).
     05 WS-ALPHANUM-2                PIC X(02).
     05 WS-ALPHANUM-3                PIC X(03).
     05 WS-ALPHANUM-4                PIC X(04).
     05 WS-ALPHANUM-5                PIC X(05).
     05 WS-ALPHANUM-6                PIC X(06).
     05 WS-ALPHANUM-36               PIC X(36).
     05 WS-AB-5                      PIC XXBXXX.
     05 WS-AB-3                      PIC XBXX.

 01  WS-NUMERIC-FIELDS.
     05 WS-DISPLAY-NUM-1             PIC 9.
     05 WS-DISPLAY-NUM-5             PIC 9(5).
     05 WS-DISPLAY-NUM-V5            PIC 9(3)V99.

 PROCEDURE DIVISION.
 0000-PROGRAM-ENTRY-POINT.
     DISPLAY "TEST02 FORMATS program entry."

     PERFORM A000-ALPHANUMERIC-TESTS THRU A000-EXIT.

     STOP RUN.

 A000-ALPHANUMERIC-TESTS.

 AN01-TEST.
     MOVE 1                   TO WS-DISPLAY-NUM-1.
     MOVE WS-DISPLAY-NUM-1    TO WS-ALPHANUM-6.
     DISPLAY "AN01:(" WS-ALPHANUM-6 "):(1     ):"
             "MOVE TEST MOVE 9(1) TO X(6)".

     MOVE 12345               TO WS-DISPLAY-NUM-5.
     MOVE WS-DISPLAY-NUM-5    TO WS-ALPHANUM-2.
     DISPLAY "AN02:(" WS-ALPHANUM-2 "):(12):"
             "MOVE TEST MOVE 9(5) TO X(2)".

     MOVE 12345               TO WS-DISPLAY-NUM-5.
     MOVE WS-DISPLAY-NUM-5    TO WS-ALPHANUM-6.
     DISPLAY "AN03:(" WS-ALPHANUM-6 "):(12345 ):"
             "MOVE TEST MOVE 9(5) TO X(6)".

     MOVE 12345               TO WS-DISPLAY-NUM-5.
     MOVE WS-DISPLAY-NUM-5    TO WS-AB-5.         
     DISPLAY "AB01:(" WS-AB-5 "):(12 345):"
             "MOVE TEST MOVE 9(5) TO XXBXXX".

     MOVE 12345               TO WS-DISPLAY-NUM-5.
     MOVE WS-DISPLAY-NUM-5    TO WS-AB-3.         
     DISPLAY "AB02:(" WS-AB-3 "):(1 23):"
             "MOVE TEST MOVE 9(5) TO XBXX".

     MOVE 123.45              TO WS-DISPLAY-NUM-V5.
     DISPLAY "AV01:(" WS-DISPLAY-NUM-V5 "):(12345):"
             "MOVE TEST MOVE 123.45 9(3)V99".

     MOVE 123.45              TO WS-DISPLAY-NUM-5.
     DISPLAY "AV02:(" WS-DISPLAY-NUM-5 "):(00123):"
             "MOVE TEST MOVE 123.45 TO 9(5)".

 A000-EXIT.
     EXIT.
