 IDENTIFICATION DIVISION.
 PROGRAM-ID. TEST08A.
 ENVIRONMENT DIVISION.
 CONFIGURATION SECTION.
  SPECIAL-NAMES.
* INPUT-OUTPUT SECTION.
* FILE-CONTROL.
 DATA DIVISION.
 FILE SECTION.

 WORKING-STORAGE SECTION.
 01     WS-STRING PIC X(40).
 01     WS-PART1  PIC X(10).
 01     WS-PART2  PIC X(10).

 PROCEDURE DIVISION.
 A-000.
     MOVE "123.45" TO WS-STRING.
     UNSTRING WS-STRING DELIMITED BY "." INTO WS-PART1 WS-PART2.
     DISPLAY "US01A:(" WS-PART1 "):(123       ):DEL '.'".
     DISPLAY "US01B:(" WS-PART2 "):(45        ):DEL '.'".
     MOVE "123 45" TO WS-STRING.
     UNSTRING WS-STRING DELIMITED BY SPACE INTO WS-PART1 WS-PART2.
     DISPLAY "US02A:(" WS-PART1 "):(123       ):DEL SP".
     DISPLAY "US02B:(" WS-PART2 "):(45        ):DEL SP".
     MOVE "123045" TO WS-STRING.
     UNSTRING WS-STRING DELIMITED BY ZERO INTO WS-PART1 WS-PART2.
     DISPLAY "US03A:(" WS-PART1 "):(123       ):DEL ZR".
     DISPLAY "US03B:(" WS-PART2 "):(45        ):DEL ZR".
     UNSTRING WS-STRING DELIMITED BY "0"  INTO WS-PART1 WS-PART2.
     DISPLAY "US04A:(" WS-PART1 "):(123       ):DEL '0'".
     DISPLAY "US04B:(" WS-PART2 "):(45        ):DEL '0'".
     MOVE "123  45" TO WS-STRING.
     UNSTRING WS-STRING DELIMITED BY "  " INTO WS-PART1 WS-PART2.
     DISPLAY "US05A:(" WS-PART1 "):(123       ):DEL '  '".
     DISPLAY "US05B:(" WS-PART2 "):(45        ):DEL '  '".
     STOP RUN.
