 IDENTIFICATION DIVISION.
 PROGRAM-ID. CTEST01_PARSE.
 AUTHOR.  GLEN COLBERT.
 INSTALLATION. Tiny Cobol Compiler Project.
 DATE-WRITTEN. 11-21-1999.
 DATE-COMPILED.
 SECURITY. NONE.
* Parser tests for the ENV DIV
* Does it recognize obj cp? 

 ENVIRONMENT DIVISION.
 CONFIGURATION SECTION.
 SOURCE-COMPUTER. Linux.
 OBJECT-COMPUTER. Linux.

* INPUT-OUTPUT SECTION.
* FILE-CONTROL.
 DATA DIVISION.
 FILE SECTION.

 WORKING-STORAGE SECTION.

 PROCEDURE DIVISION.
   STOP RUN.
 A000-EXIT.
     EXIT.
