 IDENTIFICATION DIVISION.
 PROGRAM-ID.    CTESTP_SEARCH2.
 ENVIRONMENT DIVISION.
*  TEST SEARCH VERB FORMAT 2.

 CONFIGURATION SECTION.
* INPUT-OUTPUT SECTION.
 DATA DIVISION.
 WORKING-STORAGE SECTION.

 01  TABLE-AREA   PIC X(40) VALUE
     "AABBCCDDEEFFGGHHIIJJKKLLMMNNOOPPQQRRSSTT".
 01  TABLE1 REDEFINES TABLE-AREA.
     05 TB1-ENTRY OCCURS 20 TIMES
                  ASCENDING KEY IS TB1-VALUE
                  INDEXED BY TB1-IDX
		  .
         10  TB1-VALUE PIC X(2).
 01  WS-XX             PIC XX.

 PROCEDURE DIVISION.
 0000-MAIN.
     MOVE "JJ" TO WS-XX.
     SEARCH ALL TB1-ENTRY
         AT END
             DISPLAY "FAIL"
         WHEN TB1-VALUE(TB1-IDX) = WS-XX
             DISPLAY "PASS"
     END-SEARCH.
     STOP RUN.
