 IDENTIFICATION DIVISION.
 PROGRAM-ID. CTEST01_FEATURES.
 AUTHOR.  GLEN COLBERT.
 INSTALLATION. Tiny Cobol Compiler Project.
 DATE-WRITTEN. 11-21-1999.
 DATE-COMPILED.
 SECURITY. NONE.
* This program will compile even if
* it does not have a DATA DIVISION 

 ENVIRONMENT DIVISION.
* INPUT-OUTPUT SECTION.
* FILE-CONTROL.


 PROCEDURE DIVISION.
   STOP RUN.
 A000-EXIT.
     EXIT.
