 IDENTIFICATION DIVISION.
 PROGRAM-ID.    CTESTP_STRING1.
 ENVIRONMENT DIVISION.
*  TEST STRING VERB .

 CONFIGURATION SECTION.
* INPUT-OUTPUT SECTION.
 DATA DIVISION.
 WORKING-STORAGE SECTION.

 01  TABLE-AREA   PIC X(40) VALUE SPACES.
 01  WS-XX        PIC XX VALUE "AA".
 01  WS-POINTER   PIC S9(4) COMP.

 PROCEDURE DIVISION.
 0000-MAIN.
     STRING WS-XX DELIMITED BY SIZE
         INTO TABLE-AREA
         WITH POINTER WS-POINTER
         ON OVERFLOW
             DISPLAY "FAIL"
     END-STRING.
     STOP RUN.
