 IDENTIFICATION DIVISION.
 PROGRAM-ID. CTESTP_SUBTRACT3.
 AUTHOR.  STEPHEN CONNOLLY.
 INSTALLATION. Tiny Cobol Compiler Project.
 SECURITY. NONE.
* TEST SUBTRACT VERB FORMAT 3.

 ENVIRONMENT DIVISION.
* INPUT-OUTPUT SECTION.
* FILE-CONTROL.

 DATA DIVISION.
 FILE SECTION.

 WORKING-STORAGE SECTION.
 01  WS-VARIABLES.
     05 WS-DATA                           PIC X(5).
     05 WS-INT1                           PIC S9(4) COMP VALUE 4 .
     05 WS-INT2                           PIC S9(4) COMP VALUE 5 .
     05 WS-INT3                           PIC S9(9) COMP.

 01  WS-VARIABLE2.
     05 WS-INT1                           PIC S9(4) COMP VALUE 4 .
     05 WS-INT2                           PIC S9(4) COMP VALUE 5 .

 PROCEDURE DIVISION.
 000-MAIN.
     SUBTRACT CORRESPONDING WS-INT1 of WS-VARIABLES FROM WS-INT2 of WS-VARIABLES ROUNDED
         ON SIZE ERROR
             MOVE "FAIL" TO WS-DATA of WS-VARIABLES
         NOT ON SIZE ERROR
             MOVE "PASS" TO WS-DATA of WS-VARIABLES
     END-SUBTRACT.
     DISPLAY WS-DATA of WS-VARIABLES.
     SUBTRACT CORR WS-INT1 of WS-VARIABLES FROM WS-INT2 of WS-VARIABLES ROUNDED
         ON SIZE ERROR
             MOVE "FAIL" TO WS-DATA of WS-VARIABLES
*         NOT ON SIZE ERROR
*             MOVE "PASS" TO WS-DATA
     END-SUBTRACT.
     DISPLAY WS-DATA of WS-VARIABLES.
     STOP RUN.
