 IDENTIFICATION DIVISION.
 PROGRAM-ID.    CTESTP_SEARCH1.
 ENVIRONMENT DIVISION.
*  TEST SEARCH VERB FORMAT 1.

 CONFIGURATION SECTION.
* INPUT-OUTPUT SECTION.
 DATA DIVISION.
 WORKING-STORAGE SECTION.

 01  WS-XX             PIC XX.
 01  WS-TABLE1.
     05 TB1-ENTRY OCCURS 20 TIMES
                  INDEXED BY TB1-IDX.
         10  TB1-VALUE PIC X(2).

 PROCEDURE DIVISION.
 0000-MAIN.
     SET TB1-IDX TO 1.
     MOVE "JJ" TO WS-XX.
     SEARCH TB1-ENTRY VARYING TB1-IDX
         AT END
             DISPLAY "FAIL"
         WHEN TB1-VALUE(TB1-IDX) = WS-XX
             DISPLAY "PASS"
     END-SEARCH.
     STOP RUN.
