 IDENTIFICATION DIVISION.
 PROGRAM-ID. CTEST03.
* AUTHOR.  GLEN COLBERT, David Essex.

* ENVIRONMENT DIVISION.
* INPUT-OUTPUT SECTION.
* FILE-CONTROL.
* DATA DIVISION.
* FILE SECTION.

* WORKING-STORAGE SECTION.

 PROCEDURE DIVISION.
*   STOP RUN.
* A000-EXIT.
*     EXIT.
