 IDENTIFICATION DIVISION.
 PROGRAM-ID. CTESTP_MULTIPLY2.
 AUTHOR.  STEPHEN CONNOLLY.
 INSTALLATION. Tiny Cobol Compiler Project.
 SECURITY. NONE.
* TEST MULTIPLY VERB FORMAT 2.

 ENVIRONMENT DIVISION.
* INPUT-OUTPUT SECTION.
* FILE-CONTROL.

 DATA DIVISION.
 FILE SECTION.

 WORKING-STORAGE SECTION.
 01  WS-VARIABLES.
     05 WS-DATA                           PIC X(5).
     05 WS-INT1                           PIC S9(4) COMP VALUE 4 .
     05 WS-INT2                           PIC S9(4) COMP VALUE 5 .
     05 WS-INT3                           PIC S9(9) COMP.

 PROCEDURE DIVISION.
 000-MAIN.
     MULTIPLY WS-INT1 BY WS-INT2 
         GIVING WS-INT3 ROUNDED
         ON SIZE ERROR
             MOVE "FAIL" TO WS-DATA
*         NOT ON SIZE ERROR
*             MOVE "PASS" TO WS-DATA
     END-MULTIPLY.
     DISPLAY WS-DATA.
     STOP RUN.
