 IDENTIFICATION DIVISION.
 PROGRAM-ID.    CTESTP_READ1.
 ENVIRONMENT DIVISION.
*  TEST READ VERB FORMAT 1 (SEQUENTIAL).

 CONFIGURATION SECTION.
 INPUT-OUTPUT SECTION.
 FILE-CONTROL.
     SELECT GOZOUT
            ASSIGN TO "./input.dat" 
            ORGANIZATION IS SEQUENTIAL
            ACCESS       IS SEQUENTIAL
            FILE STATUS  IS FS.

 DATA DIVISION.
 FILE SECTION.

 FD  GOZOUT
     LABEL RECORD IS STANDARD.
 01  GOZOUT-REC.
     03 X-IND                         PIC  9(03).
     03 DESCRIPTION                   PIC  X(20).
     03 FILLER                        PIC  X(57).

 WORKING-STORAGE SECTION.
 01  FS                              PIC  9(02).
 01  WS-COUNTERS.
     05 WS-TEST-COUNTER              PIC  9(4).
 01  WS-DATA                         PIC X(80).
 01  WS-NAME                         PIC X(80).

 PROCEDURE DIVISION.
 0000-MAIN.
      MOVE "./INPUT.DAT" TO WS-NAME.
      OPEN OUTPUT GOZOUT.
      READ GOZOUT NEXT RECORD INTO WS-DATA
          AT END
              MOVE "FAIL" TO DESCRIPTION
*          NOT AT END
*              MOVE "PASS" TO DESCRIPTION
      END-READ.
      CLOSE GOZOUT.
      STOP RUN.
