 IDENTIFICATION DIVISION.
 PROGRAM-ID. CTESTP_CONTINUE1.
 AUTHOR.  STEPHEN CONNOLLY.
 INSTALLATION. Tiny Cobol Compiler Project.
 SECURITY. NONE.
* TEST CONTINUE VERB.

 ENVIRONMENT DIVISION.
* INPUT-OUTPUT SECTION.
* FILE-CONTROL.

 DATA DIVISION.
 FILE SECTION.

 WORKING-STORAGE SECTION.
 01  WS-VARIABLES.
     05 WS-DATA                           PIC X(5).
     05 WS-INT1                           PIC S9(4) COMP VALUE 4 .
     05 WS-INT2                           PIC S9(4) COMP VALUE 5 .
     05 WS-INT3                           PIC S9(9) COMP.

 PROCEDURE DIVISION.
 000-MAIN.
     MOVE "PASS" TO WS-DATA.
     IF WS-INT1 > 0
         CONTINUE
     ELSE
         MOVE "FAIL" TO WS-DATA
     END-IF.
     DISPLAY WS-DATA.
     STOP RUN.
