 IDENTIFICATION DIVISION.
 PROGRAM-ID.    CTESTP_UNSTRING1.
 ENVIRONMENT DIVISION.
*  TEST UNSTRING VERB .

 CONFIGURATION SECTION.
* INPUT-OUTPUT SECTION.
 DATA DIVISION.
 WORKING-STORAGE SECTION.

 01  TABLE-AREA   PIC X(40) VALUE "12 43 56".
 01  WS-XX1             PIC XX VALUE SPACES.
 01  WS-XX2             PIC XX VALUE SPACES.
 01  WS-POINTER        PIC S9(4) COMP.
 01  WS-COUNT          PIC S9(4) COMP.
 01  WS-TALLY          PIC S9(4) COMP.

 PROCEDURE DIVISION.
 0000-MAIN.
     UNSTRING TABLE-AREA
         DELIMITED BY
            ALL SPACES OR ALL ","
         INTO WS-XX1
             DELIMITER IN WS-XX2
             COUNT     IN WS-COUNT
         WITH POINTER WS-POINTER
         TALLYING IN WS-TALLY
         ON OVERFLOW
             DISPLAY "FAIL"
     END-UNSTRING.
     STOP RUN.
