 IDENTIFICATION DIVISION.
 PROGRAM-ID. CTESTP_ADD3.
 AUTHOR.  STEPHEN CONNOLLY.
 INSTALLATION. Tiny Cobol Compiler Project.
 SECURITY. NONE.
* TEST ADD VERB FORMAT 3.

 ENVIRONMENT DIVISION.
* INPUT-OUTPUT SECTION.
* FILE-CONTROL.

 DATA DIVISION.
 FILE SECTION.

 WORKING-STORAGE SECTION.
 01  WS-VARIABLES.
     05 WS-DATA                           PIC X(5).
     05 WS-INT1                           PIC S9(4) COMP VALUE 4 .
     05 WS-INT2                           PIC S9(4) COMP VALUE 5 .
     05 WS-INT3                           PIC S9(9) COMP.

 01  WS-VARIABLE2.
     05 WS-INT1                           PIC S9(4) COMP VALUE 4 .
     05 WS-INT2                           PIC S9(4) COMP VALUE 5 .

 PROCEDURE DIVISION.
 000-MAIN.
     ADD CORRESPONDING WS-INT1 of WS-VARIABLES TO WS-INT2 of WS-VARIABLES ROUNDED
         ON SIZE ERROR
             MOVE "FAIL" TO WS-DATA of WS-VARIABLES
         NOT ON SIZE ERROR
             MOVE "PASS" TO WS-DATA OF WS-VARIABLES
     END-ADD.
     DISPLAY WS-DATA OF WS-VARIABLES.
     ADD CORR WS-INT1 OF WS-VARIABLES TO WS-INT2 OF WS-VARIABLES ROUNDED
         ON SIZE ERROR
             MOVE "FAIL" TO WS-DATA OF WS-VARIABLES
         NOT ON SIZE ERROR
             MOVE "PASS" TO WS-DATA of WS-VARIABLES
     END-ADD.
     DISPLAY WS-DATA of WS-VARIABLES.
     STOP RUN.
