 IDENTIFICATION DIVISION.
 PROGRAM-ID. CTEST01_FEATURES.
 AUTHOR.  GLEN COLBERT.
 INSTALLATION. Tiny Cobol Compiler Project.
 DATE-WRITTEN. 11-21-1999.
 DATE-COMPILED.
 SECURITY. NONE.
* Are reserved words in comment lines ignored?
* This should not be paresed DATA DIVISION 

 ENVIRONMENT DIVISION.
* INPUT-OUTPUT SECTION.
* FILE-CONTROL.
 DATA DIVISION.
 FILE SECTION.

 WORKING-STORAGE SECTION.

 PROCEDURE DIVISION.
   STOP RUN.
 A000-EXIT.
     EXIT.
