 IDENTIFICATION DIVISION.
 PROGRAM-ID. CTEST01_PARSER.
 AUTHOR.  GLEN COLBERT.
 INSTALLATION. Tiny Cobol Compiler Project.
 DATE-WRITTEN. 11-21-1999.
 DATE-COMPILED.
 SECURITY. NONE.
* test for curncy sgn

 ENVIRONMENT DIVISION.
 CONFIGURATION SECTION.
 SPECIAL-NAMES.
 DECIMAL-POINT IS COMMA.

* INPUT-OUTPUT SECTION.
* FILE-CONTROL.
 DATA DIVISION.
 FILE SECTION.

 WORKING-STORAGE SECTION.

 PROCEDURE DIVISION.
   STOP RUN.
 A000-EXIT.
     EXIT.
