 IDENTIFICATION DIVISION.
 PROGRAM-ID. CTESTP_INITIALIZE1.
 AUTHOR.  STEPHEN CONNOLLY.
 INSTALLATION. Tiny Cobol Compiler Project.
 SECURITY. NONE.
* TEST INITIALIZE VERB FULL FORMAT.

 ENVIRONMENT DIVISION.
* INPUT-OUTPUT SECTION.
* FILE-CONTROL.

 DATA DIVISION.
 FILE SECTION.

 WORKING-STORAGE SECTION.
 01  WS-VARIABLES.
     05 WS-DATA                           PIC X(5).
     05 WS-INT1                           PIC S9(4) COMP VALUE 4 .
     05 WS-INT2                           PIC S9(4) COMP VALUE 5 .
     05 WS-INT3                           PIC S9(9) COMP.
     05 WS-INT4                           PIC S9(9) COMP.

 PROCEDURE DIVISION.
 000-MAIN.
     INITIALIZE WS-VARIABLES
         REPLACING ALPHABETIC   DATA BY "A"
                   ALPHANUMERIC DATA BY "0"
                   NUMERIC      DATA BY ZEROES
                   ALPHANUMERIC-EDITED DATA BY SPACES
                   NUMERIC-EDITED BY ZEROES.
     STOP RUN.
