 IDENTIFICATION DIVISION.
 PROGRAM-ID. CTEST_PIX.
 AUTHOR.  GLEN COLBERT.
 INSTALLATION. Tiny Cobol Compiler Project.
 SECURITY. NONE.
* Pares tests for pictures.

 ENVIRONMENT DIVISION.
* INPUT-OUTPUT SECTION.
* FILE-CONTROL.

 DATA DIVISION.
 FILE SECTION.

 WORKING-STORAGE SECTION.
 01  WS-VARIABLES.
     05 WS-LARGE-P1   USAGE IS COMPUTATIONAL-2.
     05 WS-LARGE-P2   USAGE IS COMP-2.
     05 WS-NORMAL-P1  USAGE IS COMPUTATIONAL-1.
     05 WS-NORMAL-P2  USAGE IS COMP-1.
     05 WS-NORMAL-P3  USAGE IS FLOAT-SHORT.
     05 WS-LARGE-P3   USAGE IS FLOAT-LONG.

 PROCEDURE DIVISION.
   MOVE 1.1     TO WS-LARGE-P1.
   MOVE 2.2     TO WS-LARGE-P2.
   MOVE 3.3     TO WS-NORMAL-P1.
   MOVE 4.4     TO WS-NORMAL-P2.
   MOVE 5.5     TO WS-NORMAL-P3.
   MOVE 6.6     TO WS-LARGE-P3.
   STOP RUN.
 A000-EXIT.
     EXIT.
