 IDENTIFICATION DIVISION.
 PROGRAM-ID. TEST1_FORMATS.
 AUTHOR.  GLEN COLBERT.
 INSTALLATION. FOOBAR WIDGETS 1999.
 DATE-WRITTEN. 12 November, 1999.
 DATE-COMPILED.
 SECURITY.
* Note that the REMARKS clause is not part of the ANS COBOL 85 standard.
 REMARKS.

 ENVIRONMENT DIVISION.
* INPUT-OUTPUT SECTION.
* FILE-CONTROL.
 DATA DIVISION.
 FILE SECTION.

 WORKING-STORAGE SECTION.

 PROCEDURE DIVISION.
   STOP RUN.
 A000-EXIT.
     EXIT.
