 IDENTIFICATION DIVISION.
 PROGRAM-ID. TEST5_STRUCTURE.
 AUTHOR.  GLEN COLBERT.
 INSTALLATION. FOOBAR WIDGETS 1999.
 DATE-WRITTEN. 12 November, 1999.
 DATE-COMPILED.
 SECURITY.
* Note that the REMARKS clause is not part of the ANS COBOL 85 standard.
 REMARKS. CHECK TO SEE THAT THE REMARKS SECTION ALLOWS
          MULTI-LINE EXPLANATIONS OF JUST WHAT THE CODE DOES AND
          DOES NOT DO.  THE COMPILER SHOULD IGNORE EVERYTHING FROM
          THE REMARKS TOKEN TO THE NEXT RECOGNIZED SECTION OR
          DIVISION HEADER.

 ENVIRONMENT DIVISION.
* INPUT-OUTPUT SECTION.
* FILE-CONTROL.
 DATA DIVISION.
 FILE SECTION.

 WORKING-STORAGE SECTION.

 PROCEDURE DIVISION.
   STOP RUN.
 A000-EXIT.
     EXIT.
