 IDENTIFICATION DIVISION.
 PROGRAM-ID.    CTESTP_SET1.
 ENVIRONMENT DIVISION.
*  TEST SET VERB ALL FORMATS .

 CONFIGURATION SECTION.
* SPECIAL-NAMES.
*   SW0 IS SORT-SWITCH
*        ON  STATUS IS SORT-ON
*        OFF STATUS IS SORT-OFF.
* INPUT-OUTPUT SECTION.
 DATA DIVISION.
 WORKING-STORAGE SECTION.

 01  TABLE-AREA   PIC X(40) VALUE
     "AABBCCDDEEFFGGHHIIJJKKLLMMNNOOPPQQRRSSTT".
 01  TABLE1 REDEFINES TABLE-AREA.
     05 TB1-ENTRY OCCURS 20 TIMES
                  INDEXED BY TB1-IDX.
         10  TB1-VALUE PIC X(2).
 01  WS-XX             PIC XX.
     88 VALID-DATA   VALUE "JJ".
 01  WS-INT            PIC S9(4) COMP VALUE 10 .

 PROCEDURE DIVISION.
 0000-MAIN.
     SET TB1-IDX TO 1.
     SET TB1-IDX UP BY WS-INT.
     SET TB1-IDX DOWN BY WS-INT.

*    SET SORT-SWITCH TO ON.

     MOVE "AA" TO WS-XX.
     SET VALID-DATA TO TRUE.

     STOP RUN.
