 IDENTIFICATION DIVISION.
 PROGRAM-ID. COBSUB.
 ENVIRONMENT DIVISION.

 CONFIGURATION SECTION. 
 SPECIAL-NAMES.
     DECIMAL-POINT IS COMMA.
* INPUT-OUTPUT SECTION.
* FILE-CONTROL.

 DATA DIVISION.
 FILE SECTION.

 WORKING-STORAGE SECTION.
 01  VAR3   PIC X(20) value "String to return.".

 LINKAGE SECTION.
 01  VAR1   PIC X(20).
 01  VAR2   PIC X(20).


 PROCEDURE DIVISION USING VAR1 VAR2.
  
     display "Received from main cobol program: [" VAR1 "]".
     move VAR3 to VAR2.

     EXIT PROGRAM.

