 IDENTIFICATION DIVISION.
 PROGRAM-ID. TEST00a.
 ENVIRONMENT DIVISION.
 CONFIGURATION SECTION. 
* SPECIAL-NAMES.
* decimal-point is comma.
* INPUT-OUTPUT SECTION.
* FILE-CONTROL.
 DATA DIVISION.
 WORKING-STORAGE SECTION.

 PROCEDURE DIVISION.
 A-100.
  DISPLAY 'Hello World !'.
  STOP RUN.
