 IDENTIFICATION DIVISION.
 PROGRAM-ID. TEST15J.
 AUTHOR.  Bernard GIROUD.
 INSTALLATION. Tiny Cobol Compiler Project.
 DATE-WRITTEN. 05-AUG-2000.
 DATE-COMPILED.
 SECURITY. NONE.

 ENVIRONMENT DIVISION.
* INPUT-OUTPUT SECTION.
* FILE-CONTROL.
 DATA DIVISION.
 FILE SECTION.

 WORKING-STORAGE SECTION.
 01 PARM01 PIC X(20) VALUE "TEST".

 LINKAGE SECTION.
 01 L-PARM01 PIC X(20).

 PROCEDURE DIVISION USING L-PARM01.
     DISPLAY "TEST15J:(" L-PARM01 "):(ABCDEFGHIJ0123456789):"
             "Call by content x(20).".
     MOVE "9876543210JIHGFEDCBA" TO L-PARM01.
     EXIT PROGRAM.
