 IDENTIFICATION DIVISION.
 PROGRAM-ID. TEST15h.
 AUTHOR.  David Essex.
 INSTALLATION. Tiny Cobol Compiler Project.
 ENVIRONMENT DIVISION.
 CONFIGURATION SECTION.
* INPUT-OUTPUT SECTION.
* FILE-CONTROL.

 DATA DIVISION.
 FILE SECTION.

 WORKING-STORAGE SECTION.

 01 WS-C1       PIC 9(1).
 01 WS-C2       PIC X(3).
 01 WS-C3       PIC X(7).

 LINKAGE SECTION.

 01 C1           PIC 9(1).
 01 C2           PIC X(3).
 01 C3           PIC X(7).

PROCEDURE DIVISION USING C1 C2 C3.


 MOVE C1 TO WS-C1.

 IF WS-C1 = 0
 THEN
    PERFORM A-900
*    MOVE ZEROS TO WS-C2 WS-C3
 ELSE
   IF WS-C1 = 1
   THEN
      PERFORM A-100
*      MOVE WS-C3 TO C3
*      MOVE C2 TO WS-C3
   ELSE
      PERFORM A-200
*      DISPLAY "INVALID SELECTION = " WS-C1
   END-IF
 END-IF.
 
 EXIT PROGRAM.

A-100.

 DISPLAY "ENTER A-100".
 PERFORM A-700.
* MOVE WS-C3 TO C3.
* MOVE C2 TO WS-C3.
 DISPLAY "EXIT  A-100".

A-200.       
  
 DISPLAY "ENTER A-200".
 DISPLAY "INVALID SELECTION = " WS-C1
 DISPLAY "EXIT  A-200".

A-700.       

 DISPLAY "ENTER A-700".
 MOVE WS-C3 TO C3.
 MOVE C2 TO WS-C3.
 DISPLAY "EXIT  A-700".

A-900.       

 DISPLAY "ENTER A-900".
 MOVE ZEROS TO WS-C2 WS-C3.
 DISPLAY "EXIT  A-900".
