IDENTIFICATION DIVISION.
PROGRAM-ID. TEST03b.
ENVIRONMENT DIVISION.
CONFIGURATION SECTION. 
INPUT-OUTPUT SECTION.
FILE-CONTROL.
 SELECT FILEIN ASSIGN TO STD-INPUT 
    ORGANIZATION IS LINE SEQUENTIAL
    ACCESS MODE  IS SEQUENTIAL
    FILE STATUS  IS WS-FILEIN-STATUS.

 SELECT FILEOUT ASSIGN TO STD-OUTPUT 
    ORGANIZATION IS LINE SEQUENTIAL
*    ORGANIZATION IS SEQUENTIAL
    ACCESS MODE  IS SEQUENTIAL
    FILE STATUS  IS WS-FILEOUT-STATUS.


DATA DIVISION.
FILE SECTION.
 FD FILEIN.
 01 FILEIN-RECORD.
    05 FILLER            PIC X(20).
 FD FILEOUT.
 01 FILEOUT-RECORD.
    05 FILLER            PIC X(50).

WORKING-STORAGE SECTION.

 01 WS-FILE-STATUS.
    05 WS-FILEIN-STATUS   PIC XX.
    05 WS-FILEOUT-STATUS  PIC XX.

 01 WS-MESS.
    05 WS-MESS-1       PIC X(40) VALUE 'A numbered list of the input follows:'.
*    05 FILLER          PIC X(09) VALUE SPACES.
*    05 FILLER          PIC X(01) VALUE x'0A'.
* On Wind*ws use CRLF
*   05 FILLER          PIC X(08) VALUE SPACES.
*   05 FILLER          PIC X(02) VALUE x'0D0A'.

 01 WS-FILE-WORK.
    05 WS-OUTPUT-CNTR  PIC 9(4) VALUE 0.
    05 FILLER          PIC X(2) VALUE SPACES.
    05 WS-FILE-WORK-IN PIC X(20) VALUE SPACES.
*    05 FILLER          PIC X(23) VALUE SPACES.
*    05 FILLER          PIC X(01) VALUE x'0A'.
* On Wind*ws use CRLF
*   05 FILLER          PIC X(22) VALUE SPACES.
*   05 FILLER          PIC X(02) VALUE x'0D0A'.

 01 WS-EOF-SW          PIC X  VALUE 'N'.
    88 WS-EOF   VALUES 'Y', 'y'.
    
PROCEDURE DIVISION.
A-100. 
 OPEN INPUT  FILEIN
      OUTPUT FILEOUT.
 MOVE WS-MESS TO FILEOUT-RECORD.
 WRITE FILEOUT-RECORD.
 PERFORM A-200 UNTIL WS-EOF.
 CLOSE FILEIN FILEOUT.
 STOP RUN.

A-200.
 READ FILEIN INTO WS-FILE-WORK-IN
   AT END 
      MOVE  'Y' TO WS-EOF-SW
   NOT AT END 
      PERFORM A-300
*      ADD 1 TO WS-OUTPUT-CNTR
*      WRITE FILEOUT-RECORD FROM WS-FILE-WORK
 END-READ.

A-300.
 ADD 1 TO WS-OUTPUT-CNTR.
 WRITE FILEOUT-RECORD FROM WS-FILE-WORK.

