 IDENTIFICATION DIVISION.
 PROGRAM-ID. TEST03a.
 ENVIRONMENT DIVISION.
 CONFIGURATION SECTION. 
* SPECIAL-NAMES.
* decimal-point is comma.
* INPUT-OUTPUT SECTION.
* FILE-CONTROL.
 DATA DIVISION.
 FILE SECTION.

WORKING-STORAGE SECTION.

 01 WS-MESS.
    05 WS-MESS-1  PIC X(50) VALUE 'This program will check for an EOF condition'.
    05 WS-MESS-2  PIC X(01) VALUE x'0A'.
* On Win32 use <CRLF>
*    05 WS-MESS-2  PIC X(02) VALUE x'0D0A'.
    05 WS-MESS-3  PIC X(50) VALUE 'A numbered list of the input follows:'.
 01 WS-INPUT    PIC X(50).
 01 WS-OUTPUT.
    05 WS-OUTPUT-CNTR  PIC 9(4) VALUE 0.
    05 FILLER          PIC X(2) VALUE SPACES.
    05 WS-OUTPUT-IN    PIC X(50).
 01 WS-FS-RC           PIC 9(4) VALUE 0.
 01 WS-FS              PIC X  VALUE 'N'.
    88 WS-EOF   VALUES 'Y', 'y'.
    
PROCEDURE DIVISION.
A-100.

 DISPLAY WS-MESS.
 PERFORM A-200 UNTIL WS-EOF.
 STOP RUN.

A-200.

 ACCEPT WS-INPUT FROM STD-INPUT
   ON EXCEPTION WS-FS-RC
    MOVE 'Y' TO WS-FS
 END-ACCEPT.

 IF NOT WS-EOF 
 THEN 
    MOVE WS-INPUT TO WS-OUTPUT-IN
    ADD 1 TO WS-OUTPUT-CNTR
    DISPLAY WS-OUTPUT UPON STD-OUTPUT
 END-IF.
