 
* 01    W01-COMPUTE-A0  PIC 9(8) VALUE 30000.
 01     W01-COMPUTE-A   PIC X(2) VALUE "**".
 01     W01-COMPUTE-A0  PIC 9(8) VALUE 30000.
 01     W01-COMPUTE-A1  PIC Z(5),Z(3).
 01     W01-COMPUTE-A2  PIC *Z,ZZZ,ZZZ.
 01     W01-COMPUTE-A3  PIC Z(3)Z(5),99.
 01     W01-COMPUTE-A4  PIC 9(5)V99.

COPY 'TEST02A.cpy'.

