 
* 01    W01-COMPUTE-B0  PIC 9(8) VALUE 30000.
 01     W01-COMPUTE-B   PIC X(2) VALUE "**".
 01     W01-COMPUTE-B0  PIC 9(8) VALUE 30000.
 01     W01-COMPUTE-B1  PIC Z(5),Z(3).
 01     W01-COMPUTE-B2  PIC *Z,ZZZ,ZZZ.
 01     W01-COMPUTE-B3  PIC Z(3)Z(5),99.
 01     W01-COMPUTE-B4  PIC 9(5)V99.


