 
* 01    W01-COMPUTE-C0  PIC 9(8) VALUE 30000.
 01     W01-COMPUTE-C   PIC X(2) VALUE "**".
 01     W01-COMPUTE-C0  PIC 9(8) VALUE 30000.
 01     W01-COMPUTE-C1  PIC Z(5),Z(3).
 01     W01-COMPUTE-C2  PIC *Z,ZZZ,ZZZ.
 01     W01-COMPUTE-C3  PIC Z(3)Z(5),99.
 01     W01-COMPUTE-C4  PIC 9(5)V99.

COPY 'TEST02B.cpy'.
