 IDENTIFICATION DIVISION.
 PROGRAM-ID. TEST02a.
 ENVIRONMENT DIVISION.
 CONFIGURATION SECTION.
* INPUT-OUTPUT SECTION.
* FILE-CONTROL.
 DATA DIVISION.
 FILE SECTION.

 WORKING-STORAGE SECTION.
 01 W-1         PIC 9(5)V99.
 01 W-2         PIC 9(5)V99 COMP.
 01 W-3         PIC 9(5)V99 COMP-3.
* 01 W-3         PIC 9(5)V99 PACKED-DECIMAL.
 01 W-4         PIC 9(5)V99 COMP-5.
 01 W-DISPLAY   PIC 9(5).99.
* 01 W-DISPLAY1  PIC 9(5).

 01  WS-WHOLE-NAME        PIC X(15) VALUE 'DAVID ESSEX'.
 01  WS-LAST-NAME         PIC X(15) VALUE ALL '$'.

PROCEDURE DIVISION.
 
A-000.

 DISPLAY "ENTER A-000".
 
 MOVE WS-WHOLE-NAME(10:) TO WS-LAST-NAME.
 DISPLAY "WS-LAST-NAME =" WS-LAST-NAME ":".
 
 MOVE 98.54 TO W-1 W-2 W-3 W-4.

 MOVE W-1 TO W-DISPLAY.
 DISPLAY "W-1 {W-DISPLAY}  = " W-DISPLAY.

 MOVE W-2 TO W-DISPLAY.
 DISPLAY "W-2 {W-DISPLAY}  = " W-DISPLAY.

 MOVE W-3 TO W-DISPLAY.
 DISPLAY "W-3 {W-DISPLAY}  = " W-DISPLAY.

 MOVE W-4 TO W-DISPLAY.
 DISPLAY "W-4 {W-DISPLAY}  = " W-DISPLAY.

* MOVE W-4 TO W-DISPLAY1.
* DISPLAY "W-4 {W-DISPLAY1} = " W-DISPLAY1.

 DISPLAY "EXIT  A-000".

 STOP RUN.
