 
* 01    W01-COMPUTE-D0  PIC 9(8) VALUE 30000.
 01     W01-COMPUTE-D   PIC X(2) VALUE "**".
 01     W01-COMPUTE-D0  PIC 9(8) VALUE 30000.
 01     W01-COMPUTE-D1  PIC Z(5),Z(3).
 01     W01-COMPUTE-D2  PIC *Z,ZZZ,ZZZ.
 01     W01-COMPUTE-D3  PIC Z(3)Z(5),99.
 01     W01-COMPUTE-D4  PIC 9(5)V99.


