IDENTIFICATION DIVISION.
PROGRAM-ID. test36.
ENVIRONMENT DIVISION.
CONFIGURATION SECTION.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
 SELECT ARQ ASSIGN TO "fileTEST36.dat" 
    ORGANIZATION IS RELATIVE 
    ACCESS MODE  IS RANDOM
    RELATIVE KEY IS ARQ-KEY 
    FILE STATUS  IS FS.

DATA DIVISION.
FILE SECTION.

 FD ARQ
    LABEL RECORD IS STANDARD.
 01 REG-ARQ.
   03 ARQ-KEY          PIC  9(03).
   03 DESCRIPTION      PIC  X(60) VALUE "AAAAAAAAAAAAAAA".
 
WORKING-STORAGE SECTION.
  01 FS           PIC 9(02).
  01 W-COUNTER    PIC 9(15).
  01 REM          PIC 9(5).
  01 W01-SWITCHES PIC X(03).
  88      W01-END VALUE "YES".
  88      W01-MORE VALUE "NO".
 
PROCEDURE DIVISION.
MAIN SECTION.
   OPEN OUTPUT ARQ.
   MOVE ZERO TO W-COUNTER.
   PERFORM WRITE-IT 998 TIMES.
   CLOSE ARQ.
   OPEN I-O ARQ.
   MOVE "NO" TO W01-SWITCHES.
   PERFORM READ-IT UNTIL W01-END.
   CLOSE ARQ.
   STOP RUN.

WRITE-IT.
   ADD 1 TO W-COUNTER.
   MOVE W-COUNTER TO ARQ-KEY.
   WRITE REG-ARQ.

READ-IT.
   DISPLAY "Enter the Record to Lock (1-998) 0 to Stop".
   ACCEPT W-COUNTER.
   MOVE W-COUNTER TO ARQ-KEY.
   IF W-COUNTER = 0
          MOVE "YES" TO W01-SWITCHES.
   READ ARQ AT END 
          MOVE "YES" TO W01-SWITCHES.
   IF W01-MORE
          DISPLAY "Record locked"
          DISPLAY REG-ARQ
          MOVE W-COUNTER TO ARQ-KEY 
          READ ARQ WITH LOCK.
   display "FS = " FS.
